#                                             Read/Write "CSV" files

In [2]:
import pandas as pd

Reading the csv file and creating the dataframe.

In [3]:
df = pd.read_csv("stock_data.csv") 
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [5]:
df = pd.read_csv("stock_data.csv",skiprows = 1) #Skips the first row in the file and create the dataframe.
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [7]:
df = pd.read_csv("stock_data.csv",header = 1) #Makes the first row as the header of the dataframe.
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [25]:
df = pd.read_csv("stock_data.csv",header = None) #Header = None ; removes the header and assigns o,1,2... as column names.
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

#### The names of the columns are provided in the form of 'list' as shown below.

In [23]:
df = pd.read_csv("stock_data.csv",header = None,names = ["tickers",'eps','revenue','price','people'])
df

   tickers            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

### Writes the dataframe into the CSV files

####  Creates the csv file in the directory with the name 'written.csv'

In [32]:
df = pd.read_csv("stock_data.csv")
df.to_csv('written.csv')

#### Creates the csv file by removing the index.

In [28]:
df.to_csv('written.csv',index = False)

#### Creates a csv file with only given columns

In [29]:
df.to_csv('written.csv',columns = ['tickers','eps'])

#### Creates a csv file without header

In [30]:
df.to_csv('written.csv',header  =False)

#### Creates a csv file without index

In [31]:
df.to_csv('written.csv', index  =False)

# Handling 'NaN' values

In [38]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [48]:
df = pd.read_csv('stock_data.csv', na_values = ['not available','n.a.'])
df                #Here the list of values passed in the na_values are replaced by 'NaN'

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

#### Here we are passing the list of values as a dictionary that are repalced as NaN .

In [47]:
df = pd.read_csv('stock_data.csv', na_values = {'eps': ['not available','n.a.'],
                                               'people':['not available','n.a.'],
                                                'revenue':['not avaialable','n.a.',-1]
                                               })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# Converters

In [52]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell
    
df = pd.read_csv("stock_data.csv", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     Sam Walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1    50     ratan tata

#### Converters are used to convert the values in the dataframe. Here the fumctions are created and those functions are used to convert the values in the dataframe.

In [61]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell

def convert_eps_cell(cell):
    if cell == 'not available':
        return 'NaN'
    return cell
    
df = pd.read_csv("stock_data.csv", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell,
        'eps' : convert_eps_cell
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     Sam Walton
2    MSFT     -1       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA    5.6       -1    50     ratan tata